liamsabs/ECE499-buoyancy-energy-storage-system/ece499-dspic33ck/hall-sensor-based-foc-dspic33ck256mp508-lvmc/pmsm.c
        //If it's in reverse make sure the speed and the phase inc reflect that
        if(uGF.bits.MotorState==0b01){
            mcappData.phaseInc = __builtin_divud((uint32_t)PHASE_INC_MULTI,
                                        (unsigned int)(mcappData.periodFilter));

            mcappData.SpeedHall = __builtin_divud((uint32_t)SPEED_MULTI, 
                                        (unsigned int)(mcappData.periodFilter));
        }
        //Otherwise it's not backwards so we good
        else if (uGF.bits.MotorState==0b10){
            mcappData.phaseInc = -__builtin_divud((uint32_t)PHASE_INC_MULTI,
                                        (unsigned int)(mcappData.periodFilter));

            mcappData.SpeedHall = -__builtin_divud((uint32_t)SPEED_MULTI, 
                                        (unsigned int)(mcappData.periodFilter));
        }
        /* if open loop */
        if (uGF.bits.OpenLoop == 1)
        {
            /* the angle is given by hall sensor in six steps */
            thetaElectrical = thetaElectricalOpenLoop;
        }
        //We are doing closed loop, add phase inclination to 
        else
        {
            /* if closed loop, angle generated by hall sensor */
            thetaElectrical = mcappData.HallTheta;

            mcappData.HallTheta = mcappData.HallTheta + mcappData.phaseInc; 

            if(mcappData.hallCorrectionCounter > 0)
            {
                mcappData.HallTheta = mcappData.HallTheta + mcappData.hallCorrectionFactor;
                mcappData.hallCorrectionCounter--;
            }
        }


        MC_CalculateSineCosine_Assembly_Ram(thetaElectrical,&sincosTheta);
        MC_TransformParkInverse_Assembly(&vdq,&sincosTheta,&valphabeta);

        MC_TransformClarkeInverseSwappedInput_Assembly(&valphabeta,&vabc);

        MC_CalculateSpaceVectorPhaseShifted_Assembly(&vabc,pwmPeriod,
                                                    &pwmDutycycle);
        PWMDutyCycleSet(&pwmDutycycle);            
    }
  
    else
    {
        INVERTERA_PWM_TRIGA = ADC_SAMPLING_POINT;
        pwmDutycycle.dutycycle3 = MIN_DUTY;
        pwmDutycycle.dutycycle2 = MIN_DUTY;
        pwmDutycycle.dutycycle1 = MIN_DUTY;
        PWMDutyCycleSet(&pwmDutycycle);
    } 
    if (uGF.bits.MotorState == 0b11)
    {
        measureInputs.current.Ia = ADCBUF_INV_A_IPHASE1;
        measureInputs.current.Ib = ADCBUF_INV_A_IPHASE2; 
        measureInputs.current.Ibus = ADCBUF_INV_A_IBUS; 
    }
   
    //If the offset value wasn't recently updated we measure it.
    if (MCAPP_MeasureCurrentOffsetStatus(&measureInputs) == 0)
    {
       //
        MCAPP_MeasureCurrentOffset(&measureInputs);
    }
    else
    {
        //Increments number of times it's entered ISR, don't know why we only do this sometimes
        BoardServiceStepIsr(); 
    }
    
    //Need to change the potvalue, this will instead be controlled by spi inputs
    measureInputs.potValue = (int16_t)( ADCBUF_SPEED_REF_A>>1);
    
    
    measureInputs.dcBusVoltage = (int16_t)( ADCBUF_VBUS_A>>1);

    //Measuring temp is good for errors
    MCAPP_MeasureTemperature(&measureInputs,(int16_t)(ADCBUF_MOSFET_TEMP_A>>1));

    //Update X2C scope
    DiagnosticsStepIsr();
    
    // State and message processing logic
    /*if(++SPICounter>=SENSOR_SAMPLE_RATE_REVS){
        
        SPIFlag = 1;
        SPICounter=0;
    }
     * */



    /* Read ADC Buffet to Clear Flag */
	adcDataBuffer = ClearADCIF_ReadADCBUF();
    ClearADCIF();   
}

void __attribute__((interrupt, no_auto_psv)) _SPI1RXInterrupt(void)
{
      
    // Check if SPI receive buffer is full
    if (SPI1STATLbits.SPIRBF == 0x01) {
        
        rxBuffer = SPI1BUFL;  // Read received data
        
        /* Processing Commands */
        if (rxBuffer == 0x01) { // store command
            
            /* State Processing Logic */
            if (system.state == IDLE || system.state == GENERATING) {
                
                system.state = STORING; // set state to storing 
                
                /* Begin Motor Spinning */
                ResetParmeters();
                uGF.bits.MotorState = 0b01;
                EnablePWMOutputsInverterAMotor();
                
            } else if (system.state == PAUSED) {
                
                if (system.unpausedState == IDLE || system.unpausedState == STORING || system.unpausedState == GENERATING) {
                    
                    system.state = STORING; // set state to storing 

                    /* Begin Motor Spinning */
                    ResetParmeters();
                    uGF.bits.MotorState = 0b01;
                    EnablePWMOutputsInverterAMotor();
                    if (system.unpausedState != IDLE) {
                        /* TODO: Unlock System */
                    }
                
                } else if (system.unpausedState == STORED) {
                    system.state = STORED; // Motor has no place to go, set back to stored
                }
            } 
               
        } else if (rxBuffer == 0x02) { // generate 
            
            /* State Processing Logic */
            if (system.state == STORING || system.state == STORED) {
                
                system.state = GENERATING; // set state to generating 
                
                /* Begin Motor Spinning */
                ResetParmeters();
                uGF.bits.MotorState = 0b10;
                EnablePWMOutputsInverterAGenerator();
                
                SPI1BUFL = 0;
                
            } else if (system.state == PAUSED) {
                
                if (system.unpausedState == IDLE) {
                    
                    system.state = IDLE;
                    
                } else {
                    system.state = GENERATING; // set state to generating 

                    /* Begin Motor Spinning */
                    ResetParmeters();
                    uGF.bits.MotorState = 0b10;
                    EnablePWMOutputsInverterAGenerator();
                }
                
                
