liamsabs/ECE499-buoyancy-energy-storage-system/ece499-dspic33ck/hall-sensor-based-foc-dspic33ck256mp508-lvmc/pmsm.c
            }   
            
        } else if (rxBuffer == 0x03) { // pause
            
            /* State Processing Logic */
            if (system.state != PAUSED) { // if IDLE or STORED, simply store state and pause
                
                if (system.state == STORING || system.state == GENERATING) {
                    ResetParmeters(); // Stop the motor, reset motor parameters
                    /* TODO: Engage Locking Mechanism */
                }
                system.unpausedState = system.state;
                system.state = PAUSED; 
                 
            } else {
                if (system.unpausedState == STORING) {
                    
                    system.state = STORING; // set back to storing
                    
                    /* Begin Motor Spinning */
                    ResetParmeters();
                    uGF.bits.MotorState = 0b01;
                    EnablePWMOutputsInverterAMotor();
                    /* TODO: Unlock mechanism */
                    
                } else if (system.unpausedState == GENERATING) {
                    
                    system.state = GENERATING; // set back to generating
                    
                    /* Begin Motor Spinning */
                    ResetParmeters();
                    uGF.bits.MotorState = 0b10;
                    EnablePWMOutputsInverterAGenerator();
                    /* TODO: Unlock mechanism */
                } else {
                    system.state = system.unpausedState;
                }
            } 
            
            
            
        } else if (rxBuffer == 0x04) { // sensor data request
            /* If this is a sensor data request*/
            while(1U == SPI1STATLbits.SPITBF); //wait to make sure SPI transfer buffer is not full
            SPI1BUFL = txBufferDummy[txCounter];  // Transmit first byte then increment
            txCounter++;
            //IEC0bits.SPI1RXIE = 0; //disable SPI1 Recieve Interrupt
            SPI1IMSKLbits.SPITBEN = 1;  //sets interrupt to trigger on SPI transmit buffer empty
            IEC0bits.SPI1TXIE = 1; //enable SPI1 Transmit Interrupt
            IFS0bits.SPI1TXIF = 0; //clear TX interrupt flag
        }   
    }
    
    SPI1BUFL = 0;
    SPI1BUFH = 0;
    
    // Clear SPI interrupt flag
    IFS0bits.SPI1RXIF = 0;    // Clear SPI1 interrupt flag  
}

void __attribute__((interrupt, no_auto_psv)) _SPI1TXInterrupt(void)
{
    if (txCounter < SPI_TX_BUFFER_SIZE) {
        while (SPI1STATLbits.SPITBF);
        //SPI1BUFL = txBufferDummy[txCounter++];  // Transmit byte then increment
        SPI1BUFL = txBufferDummy[txCounter];
        txCounter++;
        if (txCounter >= SPI_TX_BUFFER_SIZE) { // If last byte of response sent
            IEC0bits.SPI1TXIE = 0; // Disable SPI1 Transmit Interrupt
            SPI1IMSKLbits.SPITBEN = 0;  //disable interrupt to trigger on SPI transmit buffer empty
            //IEC0bits.SPI1RXIE = 1; // Enable SPI1 Receive Interrupt
            IFS0bits.SPI1RXIF = 0; // clear recieve interrupt flag
            txCounter = 0; // Reset txCounter for next transmission
            LATEbits.LATE1 = 0; //clear PORTE1 (MicroBus_A_AN) to trigger future interrupts on master
        }
    }

    IFS0bits.SPI1TXIF = 0; // Clear TX interrupt flag
}

// *****************************************************************************
/* Function:
 prepareTxData(void)

  Summary:
    Loads Transmit buffer with bus voltage, bus current, and system state

  Description:
 loads array of size SPI_TX_BUFFER_SIZE into txBuffer 
 
  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */

void prepareTxData(void){

    //load bus voltage into transmit buffer
    txBuffer[0] = (uint8_t)(measureInputs.dcBusVoltage >> 8);
    txBuffer[1] = (uint8_t)(measureInputs.dcBusVoltage);
        
    //load bus current into transmit buffer
    txBuffer[2] = (uint8_t)(measureInputs.current.Ibus >> 8);
    txBuffer[3] = (uint8_t)(measureInputs.current.Ibus);
        
    //load system state into transmit buffer
    txBuffer[4] = (uint8_t)system.state;
    
}


// *****************************************************************************
/* Function:
    CalculateParkAngle ()

  Summary:
    Function calculates the angle for open loop control

  Description:
    Generate the start sine waves feeding the motor terminals
    Open loop control, forcing the motor to align and to start speeding up .
 
  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void CalculateParkAngle(void)
{
    /* if open loop */
    if (uGF.bits.OpenLoop)
    {
        /* begin with the lock sequence, for field alignment */
        if (motorStartUpData.startupLock < LOCK_TIME)
        {
            motorStartUpData.startupLock += 1;
        }
        /* Then ramp up till the end speed */
        else if (motorStartUpData.startupRamp < END_SPEED)
        {
            motorStartUpData.startupRamp += OPENLOOP_RAMPSPEED_INCREASERATE;
        }
        /* Switch to closed loop */
        else 
        {
                #ifndef OPEN_LOOP_FUNCTIONING
                    uGF.bits.ChangeMode = 1;
                    uGF.bits.OpenLoop = 0;
                #endif
            }
        /* The angle set depends on startup ramp */
        thetaElectricalOpenLoop = sectorToAngle[mcappData.sector];
        mcappData.HallTheta = thetaElectricalOpenLoop;
    }
}
// *****************************************************************************
/* Function:
    InitControlParameters()

  Summary:
    Function initializes control parameters

  Description:
    Initialize control parameters: PI coefficients, scaling constants etc.

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitControlParameters(void)
{
    
    ctrlParm.qRefRamp = SPEEDREFRAMP;
    ctrlParm.speedRampCount = SPEEDREFRAMP_COUNT;
    /* Set PWM period to Loop Time */
    pwmPeriod = LOOPTIME_TCY;
 
    /* PI - Id Current Control */
    piInputId.piState.kp = D_CURRCNTR_PTERM;
    piInputId.piState.ki = D_CURRCNTR_ITERM;
    piInputId.piState.kc = D_CURRCNTR_CTERM;
    piInputId.piState.outMax = D_CURRCNTR_OUTMAX;
    piInputId.piState.outMin = -piInputId.piState.outMax;
    piInputId.piState.integrator = 0;
    piOutputId.out = 0;

    /* PI - Iq Current Control */
    piInputIq.piState.kp = Q_CURRCNTR_PTERM;
    piInputIq.piState.ki = Q_CURRCNTR_ITERM;
    piInputIq.piState.kc = Q_CURRCNTR_CTERM;
    piInputIq.piState.outMax = Q_CURRCNTR_OUTMAX;
    piInputIq.piState.outMin = -piInputIq.piState.outMax;
    piInputIq.piState.integrator = 0;
    piOutputIq.out = 0;

    /* PI - Speed Control */
    piInputOmega.piState.kp = SPEEDCNTR_PTERM;
    piInputOmega.piState.ki = SPEEDCNTR_ITERM;
    piInputOmega.piState.kc = SPEEDCNTR_CTERM;
    piInputOmega.piState.outMax = SPEEDCNTR_OUTMAX;
    piInputOmega.piState.outMin = -piInputOmega.piState.outMax;
    piInputOmega.piState.integrator = 0;
    piOutputOmega.out = 0;
}

void __attribute__((__interrupt__,no_auto_psv)) _PWMInterrupt()
{
    ResetParmeters();
    ClearPWMPCIFaultInverterA();
    LED1 = 1; 
    ClearPWMIF(); 
}
